One more example.
Adding the resource from scratch:

### Resource

```
resource "octopusdeploy_process_step" "step" {
  
 # `properties` parameter is not provided.
 # Only the following execution_properties are provided:
  execution_properties = {
    "Octopus.Action.RunOnServer" = "True"
    "Octopus.Action.Script.ScriptSource" = "Inline"
    "Octopus.Action.Script.Syntax" = "PowerShell"
    "Octopus.Action.Script.ScriptBody" = file("./script.ps1")
  }

  ...

}
```

### terraform plan

```
  # module.runbook-mc-infra-tf-azurerm-v4-migration["mc-infra-tf-azurerm-v4-migration"].octopusdeploy_process_step.step will be created
  + resource "octopusdeploy_process_step" "step" {
      + action_id             = (known after apply)
      + channels              = []
      + condition             = "Success"
      + container             = {
          + feed_id = "Feeds-12447"
          + image   = "#{ContainerWorkerImage}"
        }
      + environments          = []
      + excluded_environments = []
      + execution_properties  = {
          + "Octopus.Action.RunOnServer"         = "True"
          + "Octopus.Action.Script.ScriptBody"   = <<-EOT
                Write-Host("Hello World");
            EOT
          + "Octopus.Action.Script.ScriptSource" = "Inline"
          + "Octopus.Action.Script.Syntax"       = "PowerShell"
        }
      + git_dependencies      = {}
      + id                    = (known after apply)
      + is_disabled           = false
      + is_required           = true
      + name                  = "Update Terraform State"
      + notes                 = "Description"
      + package_requirement   = "LetOctopusDecide"
      + packages              = {
          + "dar-infrastructure-build" = {
              + acquisition_location = "Server"
              + feed_id              = "Feeds-12445"
              + id                   = (known after apply)
              + package_id           = "#{Infrastructure.Artifact.PackageId}"
              + properties           = {
                  + "Extract"       = "True"
                  + "SelectionMode" = "immediate"
                }
            },
        }
      + process_id            = (known after apply)
      + properties            = {}
      + slug                  = (known after apply)
      + space_id              = (known after apply)
      + start_trigger         = "StartAfterPrevious"
      + tenant_tags           = []
      + type                  = "Octopus.Script"
      + worker_pool_id        = "WorkerPools-5170"
      + worker_pool_variable  = ""
    }
```

### terraform apply

<img width="1547" height="309" alt="Image" src="https://github.com/user-attachments/assets/bf002720-504a-4bd5-abf6-8032e19f1917" />